[NoCoverage] ArrayDeclaration
src/app/auth/auth-routing.module.ts:7:24
 import { LoginPageComponent } from './pages/login-page/login-page.component';
 import { RegisterPageComponent } from './pages/register-page/register-page.component';
 
-const routes: Routes = [
-  {
-    path: '',
-    component: LayoutPageComponent,
-    children: [
-      {
-        path: 'login',
-        component: LoginPageComponent,
-      },
-      {
-        path: 'register',
-        component: RegisterPageComponent,
-      },
-      {
-        path: '',
-        redirectTo: 'login',
-        pathMatch: 'full',
-      },
-    ],
-  },
-];
+const routes: Routes = [];
 
 @NgModule({

[NoCoverage] ObjectLiteral
src/app/auth/auth-routing.module.ts:8:3
 import { RegisterPageComponent } from './pages/register-page/register-page.component';
 
 const routes: Routes = [
-  {
-    path: '',
-    component: LayoutPageComponent,
-    children: [
-      {
-        path: 'login',
-        component: LoginPageComponent,
-      },
-      {
-        path: 'register',
-        component: RegisterPageComponent,
-      },
-      {
-        path: '',
-        redirectTo: 'login',
-        pathMatch: 'full',
-      },
-    ],
-  },
+  {},
 ];
 

[NoCoverage] ArrayDeclaration
src/app/auth/auth-routing.module.ts:11:15
   {
     path: '',
     component: LayoutPageComponent,
-    children: [
-      {
-        path: 'login',
-        component: LoginPageComponent,
-      },
-      {
-        path: 'register',
-        component: RegisterPageComponent,
-      },
-      {
-        path: '',
-        redirectTo: 'login',
-        pathMatch: 'full',
-      },
-    ],
+    children: [],
   },
 ];

[NoCoverage] StringLiteral
src/app/auth/auth-routing.module.ts:13:15
     component: LayoutPageComponent,
     children: [
       {
-        path: 'login',
+        path: "",
         component: LoginPageComponent,
       },

[NoCoverage] StringLiteral
src/app/auth/auth-routing.module.ts:23:20
       {
         path: '',
         redirectTo: 'login',
-        pathMatch: 'full',
+        pathMatch: "",
       },
     ],
