[NoCoverage] StringLiteral
src/app/app-routing.module.ts:7:11
 
 const routes: Routes = [
   {
-    path: 'auth',
+    path: "",
     loadChildren: () => import('./auth/auth.module').then(m => m.AuthModule),
   },

[NoCoverage] ArrowFunction
src/app/app-routing.module.ts:8:19
 const routes: Routes = [
   {
     path: 'auth',
-    loadChildren: () => import('./auth/auth.module').then(m => m.AuthModule),
+    loadChildren: () => undefined,
   },
   {

[NoCoverage] ArrowFunction
src/app/app-routing.module.ts:8:59
 const routes: Routes = [
   {
     path: 'auth',
-    loadChildren: () => import('./auth/auth.module').then(m => m.AuthModule),
+    loadChildren: () => import('./auth/auth.module').then(() => undefined),
   },
   {

[NoCoverage] ObjectLiteral
src/app/app-routing.module.ts:10:3
     path: 'auth',
     loadChildren: () => import('./auth/auth.module').then(m => m.AuthModule),
   },
-  {
-    path: 'heroes',
-    loadChildren: () =>
-      import('./heroes/heroes.module').then(m => m.HeroesModule),
-  },
+  {},
   {
     path: '404',

[NoCoverage] ArrowFunction
src/app/app-routing.module.ts:12:19
   },
   {
     path: 'heroes',
-    loadChildren: () =>
-      import('./heroes/heroes.module').then(m => m.HeroesModule),
+    loadChildren: () => undefined,
   },
   {

[NoCoverage] ArrowFunction
src/app/app-routing.module.ts:13:45
   {
     path: 'heroes',
     loadChildren: () =>
-      import('./heroes/heroes.module').then(m => m.HeroesModule),
+      import('./heroes/heroes.module').then(() => undefined),
   },
   {

[NoCoverage] StringLiteral
src/app/app-routing.module.ts:13:14
   {
     path: 'heroes',
     loadChildren: () =>
-      import('./heroes/heroes.module').then(m => m.HeroesModule),
+      import("").then(m => m.HeroesModule),
   },
   {

[NoCoverage] ObjectLiteral
src/app/app-routing.module.ts:15:3
     loadChildren: () =>
       import('./heroes/heroes.module').then(m => m.HeroesModule),
   },
-  {
-    path: '404',
-    component: Error404PageComponent,
-  },
+  {},
   {
     path: '',

[NoCoverage] StringLiteral
src/app/app-routing.module.ts:22:16
   {
     path: '',
     redirectTo: 'heroes',
-    pathMatch: 'full',
+    pathMatch: "",
   },
   {

[NoCoverage] StringLiteral
src/app/app-routing.module.ts:26:17
   },
   {
     path: '**',
-    redirectTo: '404',
+    redirectTo: "",
   },
 ];
