[NoCoverage] BlockStatement
heroes/components/card/card.component.ts:13:20
   @Input()
   public hero!: Hero;
 
-  ngOnInit(): void {
-    if (!this.hero) {
-      throw Error('Hero property is required');
-    }
-  }
+  ngOnInit(): void {}
 }
 

[NoCoverage] ConditionalExpression
heroes/components/card/card.component.ts:14:9
   public hero!: Hero;
 
   ngOnInit(): void {
-    if (!this.hero) {
+    if (false) {
       throw Error('Hero property is required');
     }

[NoCoverage] BlockStatement
heroes/components/card/card.component.ts:14:21
   public hero!: Hero;
 
   ngOnInit(): void {
-    if (!this.hero) {
-      throw Error('Hero property is required');
-    }
+    if (!this.hero) {}
   }
 }
