[NoCoverage] StringLiteral
src/app/heroes/heroes-routing.module.ts:15:15
     component: LayoutPageComponent,
     children: [
       {
-        path: 'new-hero',
+        path: "",
         component: NewPageComponent,
       },

[NoCoverage] ObjectLiteral
src/app/heroes/heroes-routing.module.ts:22:7
         path: 'edit/:id',
         component: NewPageComponent,
       },
-      {
-        path: 'list',
-        component: ListPageComponent,
-      },
+      {},
       {
         path: 'search',

[NoCoverage] ObjectLiteral
src/app/heroes/heroes-routing.module.ts:30:7
         path: 'search',
         component: SearchPageComponent,
       },
-      {
-        path: ':id',
-        component: HeroPageComponent,
-      },
+      {},
       {
         path: '**',

[NoCoverage] ObjectLiteral
src/app/heroes/heroes-routing.module.ts:34:7
         path: ':id',
         component: HeroPageComponent,
       },
-      {
-        path: '**',
-        redirectTo: 'list',
-      },
+      {},
     ],
   },

[NoCoverage] StringLiteral
src/app/heroes/heroes-routing.module.ts:35:15
         component: HeroPageComponent,
       },
       {
-        path: '**',
+        path: "",
         redirectTo: 'list',
       },

[NoCoverage] StringLiteral
src/app/heroes/heroes-routing.module.ts:36:21
       },
       {
         path: '**',
-        redirectTo: 'list',
+        redirectTo: "",
       },
     ],
