[NoCoverage] BlockStatement
heroes/pages/hero-page/hero-page.component.ts:21:20
     private _router: Router
   ) {}
 
-  ngOnInit(): void {
-    this._activateRoute.params
-      .pipe(
-        delay(3000),
-        switchMap(({ id }) => this._http.getHeroById(id))
-      )
-      .subscribe(hero => {
-        if (!hero) {
-          this._router.navigate(['/heroes/list']);
-        }
-        this.hero = hero;
-      });
-  }
+  ngOnInit(): void {}
 
   goBack() {

[NoCoverage] ArrowFunction
heroes/pages/hero-page/hero-page.component.ts:25:19
     this._activateRoute.params
       .pipe(
         delay(3000),
-        switchMap(({ id }) => this._http.getHeroById(id))
+        switchMap(() => undefined)
       )
       .subscribe(hero => {

[NoCoverage] BlockStatement
heroes/pages/hero-page/hero-page.component.ts:27:26
         delay(3000),
         switchMap(({ id }) => this._http.getHeroById(id))
       )
-      .subscribe(hero => {
-        if (!hero) {
-          this._router.navigate(['/heroes/list']);
-        }
-        this.hero = hero;
-      });
+      .subscribe(hero => {});
   }
 

[NoCoverage] BlockStatement
heroes/pages/hero-page/hero-page.component.ts:28:20
         switchMap(({ id }) => this._http.getHeroById(id))
       )
       .subscribe(hero => {
-        if (!hero) {
-          this._router.navigate(['/heroes/list']);
-        }
+        if (!hero) {}
         this.hero = hero;
       });

[NoCoverage] BooleanLiteral
heroes/pages/hero-page/hero-page.component.ts:28:13
         switchMap(({ id }) => this._http.getHeroById(id))
       )
       .subscribe(hero => {
-        if (!hero) {
+        if (hero) {
           this._router.navigate(['/heroes/list']);
         }

[NoCoverage] BlockStatement
heroes/pages/hero-page/hero-page.component.ts:35:12
       });
   }
 
-  goBack() {
-    this._router.navigateByUrl('/heroes/list');
-  }
+  goBack() {}
 }
 
