[NoCoverage] StringLiteral
heroes/pages/layout-page/layout-page.component.ts:10:45
 })
 export class LayoutPageComponent {
   public sidebarItems = [
-    { label: 'Listado', icon: 'label', url: './list' },
+    { label: 'Listado', icon: 'label', url: "" },
     { label: 'Añadir', icon: 'add', url: './new-hero' },
     { label: 'Buscar', icon: 'search', url: './search' },

[NoCoverage] StringLiteral
heroes/pages/layout-page/layout-page.component.ts:11:14
 export class LayoutPageComponent {
   public sidebarItems = [
     { label: 'Listado', icon: 'label', url: './list' },
-    { label: 'Añadir', icon: 'add', url: './new-hero' },
+    { label: "", icon: 'add', url: './new-hero' },
     { label: 'Buscar', icon: 'search', url: './search' },
   ];

[NoCoverage] StringLiteral
heroes/pages/layout-page/layout-page.component.ts:12:14
   public sidebarItems = [
     { label: 'Listado', icon: 'label', url: './list' },
     { label: 'Añadir', icon: 'add', url: './new-hero' },
-    { label: 'Buscar', icon: 'search', url: './search' },
+    { label: "", icon: 'search', url: './search' },
   ];
 }
