[NoCoverage] BlockStatement
heroes/pages/list-page/list-page.component.ts:15:20
 
   constructor(private _heroesService: HeroesService) {}
 
-  ngOnInit(): void {
-    this._heroesService.getHeroes().subscribe(heroes => (this.heroes = heroes));
-  }
+  ngOnInit(): void {}
 }
 

[NoCoverage] ArrowFunction
heroes/pages/list-page/list-page.component.ts:16:47
   constructor(private _heroesService: HeroesService) {}
 
   ngOnInit(): void {
-    this._heroesService.getHeroes().subscribe(heroes => (this.heroes = heroes));
+    this._heroesService.getHeroes().subscribe(() => undefined);
   }
 }
