[NoCoverage] ObjectLiteral
heroes/pages/new-page/new-page.component.ts:11:5
 export class NewPageComponent {
   public publishers = [
     { id: 'DC Comics', value: 'DC - Comics' },
-    { id: 'Marvel Comics', value: 'Marvel - Comics' },
+    {},
   ];
 }
