[NoCoverage] BlockStatement
heroes/pages/search-page/search-page.component.ts:19:16
 
   constructor(private _heroService: HeroesService) {}
 
-  searchHero() {
-    const value: string = this.searchInput.value || '';
-
-    this._heroService
-      .getSuggestions(value)
-      .pipe()
-      .subscribe(heroes => (this.heroes = heroes));
-  }
+  searchHero() {}
 
   onSelectedOption(event: MatAutocompleteSelectedEvent) {

[NoCoverage] ConditionalExpression
heroes/pages/search-page/search-page.component.ts:20:27
   constructor(private _heroService: HeroesService) {}
 
   searchHero() {
-    const value: string = this.searchInput.value || '';
+    const value: string = false;
 
     this._heroService

[NoCoverage] ConditionalExpression
heroes/pages/search-page/search-page.component.ts:20:27
   constructor(private _heroService: HeroesService) {}
 
   searchHero() {
-    const value: string = this.searchInput.value || '';
+    const value: string = true;
 
     this._heroService

[NoCoverage] ArrowFunction
heroes/pages/search-page/search-page.component.ts:25:18
     this._heroService
       .getSuggestions(value)
       .pipe()
-      .subscribe(heroes => (this.heroes = heroes));
+      .subscribe(() => undefined);
   }
 

[NoCoverage] BlockStatement
heroes/pages/search-page/search-page.component.ts:28:57
       .subscribe(heroes => (this.heroes = heroes));
   }
 
-  onSelectedOption(event: MatAutocompleteSelectedEvent) {
-    if (!event.option.value) {
-      this.selectedHero = undefined;
-      return;
-    }
-
-    const hero: Hero = event.option.value;
-
-    this.searchInput.setValue(hero.superhero);
-    this.selectedHero = hero;
-  }
+  onSelectedOption(event: MatAutocompleteSelectedEvent) {}
 }
 

[NoCoverage] ConditionalExpression
heroes/pages/search-page/search-page.component.ts:29:9
   }
 
   onSelectedOption(event: MatAutocompleteSelectedEvent) {
-    if (!event.option.value) {
+    if (true) {
       this.selectedHero = undefined;
       return;

[NoCoverage] BlockStatement
heroes/pages/search-page/search-page.component.ts:29:30
   }
 
   onSelectedOption(event: MatAutocompleteSelectedEvent) {
-    if (!event.option.value) {
-      this.selectedHero = undefined;
-      return;
-    }
+    if (!event.option.value) {}
 
     const hero: Hero = event.option.value;
