[NoCoverage] BlockStatement
app/heroes/pipes/hero-image.pipe.ts:8:33
   name: 'heroImage',
 })
 export class HeroImagePipe implements PipeTransform {
-  transform(hero: Hero): string {
-    if (!hero.id && !hero.alt_img) {
-      return 'assets/no-image.png';
-    }
-
-    if (hero.alt_img) return hero.alt_img;
-
-    return `assets/heroes/${hero.id}.jpg`;
-  }
+  transform(hero: Hero): string {}
 }
 

[NoCoverage] BlockStatement
app/heroes/pipes/hero-image.pipe.ts:9:36
 })
 export class HeroImagePipe implements PipeTransform {
   transform(hero: Hero): string {
-    if (!hero.id && !hero.alt_img) {
-      return 'assets/no-image.png';
-    }
+    if (!hero.id && !hero.alt_img) {}
 
     if (hero.alt_img) return hero.alt_img;

[NoCoverage] ConditionalExpression
app/heroes/pipes/hero-image.pipe.ts:9:9
 })
 export class HeroImagePipe implements PipeTransform {
   transform(hero: Hero): string {
-    if (!hero.id && !hero.alt_img) {
+    if (false) {
       return 'assets/no-image.png';
     }

[NoCoverage] ConditionalExpression
app/heroes/pipes/hero-image.pipe.ts:13:9
       return 'assets/no-image.png';
     }
 
-    if (hero.alt_img) return hero.alt_img;
+    if (true) return hero.alt_img;
 
     return `assets/heroes/${hero.id}.jpg`;

[NoCoverage] ConditionalExpression
app/heroes/pipes/hero-image.pipe.ts:13:9
       return 'assets/no-image.png';
     }
 
-    if (hero.alt_img) return hero.alt_img;
+    if (false) return hero.alt_img;
 
     return `assets/heroes/${hero.id}.jpg`;

[NoCoverage] StringLiteral
app/heroes/pipes/hero-image.pipe.ts:15:12
 
     if (hero.alt_img) return hero.alt_img;
 
-    return `assets/heroes/${hero.id}.jpg`;
+    return ``;
   }
 }
