[NoCoverage] BlockStatement
app/heroes/services/heroes.service.ts:13:35
 
   constructor(private _http: HttpClient) {}
 
-  getHeroes(): Observable<Hero[]> {
-    return this._http.get<Hero[]>(`${this.baseUrl}/heroes`);
-  }
+  getHeroes(): Observable<Hero[]> {}
 
   getHeroById(id: string): Observable<Hero | undefined> {

[NoCoverage] BlockStatement
app/heroes/services/heroes.service.ts:17:57
     return this._http.get<Hero[]>(`${this.baseUrl}/heroes`);
   }
 
-  getHeroById(id: string): Observable<Hero | undefined> {
-    return this._http
-      .get<Hero>(`${this.baseUrl}/heroes/${id}`)
-      .pipe(catchError(() => of(undefined)));
-  }
+  getHeroById(id: string): Observable<Hero | undefined> {}
 
   getSuggestions(query: string): Observable<Hero[]> {

[NoCoverage] ArrowFunction
app/heroes/services/heroes.service.ts:20:24
   getHeroById(id: string): Observable<Hero | undefined> {
     return this._http
       .get<Hero>(`${this.baseUrl}/heroes/${id}`)
-      .pipe(catchError(() => of(undefined)));
+      .pipe(catchError(() => undefined));
   }
 

[NoCoverage] BlockStatement
app/heroes/services/heroes.service.ts:23:53
       .pipe(catchError(() => of(undefined)));
   }
 
-  getSuggestions(query: string): Observable<Hero[]> {
-    return this._http.get<Hero[]>(`${this.baseUrl}/heroes?q=${query}&_limit=6`);
-  }
+  getSuggestions(query: string): Observable<Hero[]> {}
 }
 
